# Пользователь вводит число. Проверь, что оно положительное и меньше 100.
x = int(input("Введите число: "))
print(x > 0 and x < 100)