# Пользователь вводит два числа. Выведи True, если первое больше второго, иначе False.
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(a > b)