# Пользователь вводит число. Выведи True, если оно чётное, иначе False.
x = int(input("Введите число: "))
print(x % 2 == 0)