# Пользователь вводит слово. Выведи его первый и последний символ.
word = input("Введите слово: ")
print("Первый символ:", word[0])
print("Последний символ:", word[-1])