# Пользователь вводит предложение. Посчитай количество пробелов.
s = input("Введите предложение: ")
print("Количество пробелов:", s.count(" "))