# Дана строка. Выведи её в обратном порядке.
s = input("Введите строку: ")
print("Обратная строка:", s[::-1])
