# Пользователь вводит число. Вывести его квадрат и куб.

x = int(input("Введите число: "))
print("Квадрат:", x ** 2)
print("Куб:", x ** 3)