# Пользователь вводит строку. Проверь, что её длина больше 5 символов.
s = input("Введите строку: ")
print(len(s) > 5)