# Пользователь вводит имя и фамилию. Выведи приветствие: «Привет, Имя Фамилия!».
name = input("Введите имя: ")
surname = input("Введите фамилию: ")
print("Привет,", name, surname + "!")