# Пользователь вводит два слова. Соедини их через дефис.
w1 = input("Введите первое слово: ")
w2 = input("Введите второе слово: ")
print(w1 + "-" + w2)