# Пользователь вводит строку. Выведи её в верхнем и нижнем регистре.
s = input("Введите строку: ")
print(s.upper())
print(s.lower())